<?php

namespace app\modules\Qm\services;

use app\models\ChatForm;
use Yii;
/**
 * Главные орекстратор, последовательно вызывает сервисы:
 * - сохраняет запрос пользователя в БД
 * - вызывает оркестратор MCP‑агент
 */
class ProcessChatMessageService {

    public function run(ChatForm $formModel){
            // Сохранили последенее сообщение пользователя и получили историю его сообщений
            Yii::$app->getModule('Qm')->get('saveMessageAndGetStoryService')->run($formModel);
            // вызываем сервис который делает запрос к ИИ и возвращает ответ
            // Этот сервис внутри должен вызвать последовательно сервисы получения ответа от ИИ и записи ответа в БД
            // вызывает сервис который выполнит инструкцию ИИ
            // сервис который отправит в ии результаты выполненой операции и  получит ответ
            // 
            Yii::$app->getModule('Qm')->get('getAnswerAiAndSaveService')->run($formModel);

            // Перезаписываем данные в $formModel, станавливаем роль ассистента и текст ответа ИИ
            // Валедируем данные в $formModel
            // Вызваем сервис сохранения сообщения

            // проверяем есть ли в DtoAi указание на дейтвие которое необходимо выполнить
            // если есть, то проверяем разрешено ли это действие. 
            // Вызываем соответствующий сервис
            // Отправлем результат работы сервиса в ИИ для генерации итогового ответа
            // Сохраняем результат в БД
            // 

    }

}